import ast
import os

def run_user_script(user_input):
    # =========================================================
    # 1. معالجة النص بدالة التنفيذ
    # =========================================================
    
    # --- [الحالة الآمنة حالياً: ✔ Exit Code 0] ---
    # return ast.literal_eval(user_input)


    # --- [الحالة الخطرة: ❌ Exit Code 1] ---
    # للتبديل للحالة الخطرة: ضع (#) على السطر الآمن أعلاه، وأزل (#) عن السطر التالي:
    return eval(user_input)  # ثغرة B307: eval تتيح للمخترق تنفيذ أكواد خبيثة


# =========================================================
# 2. تعيين كلمة السر
# =========================================================

# --- [الحالة الآمنة حالياً: ✔ Exit Code 0] ---
# DB_PASSWORD = os.getenv("DB_PASSWORD")

# --- [الحالة الخطرة: ❌ Exit Code 1] ---
# للتبديل للحالة الخطرة: ضع (#) على السطر الآمن أعلاه، وأزل (#) عن السطر التالي:
DB_PASSWORD = "Hardcoded_Secret_Password_123"  # ثغرة B105: كلمة سر صريحة ومكشوفة في الكود
